# Time Series on Dataset

In [1]:
import numpy as np
import pandas as pd

In [2]:
opsd_daily = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/opsd_germany_daily.csv')

In [3]:
opsd_daily.head(10)

         Date  Consumption  Wind  Solar  Wind+Solar
0  2006-01-01     1069.184   NaN    NaN         NaN
1  2006-01-02     1380.521   NaN    NaN         NaN
2  2006-01-03     1442.533   NaN    NaN         NaN
3  2006-01-04     1457.217   NaN    NaN         NaN
4  2006-01-05     1477.131   NaN    NaN         NaN
5  2006-01-06     1403.427   NaN    NaN         NaN
6  2006-01-07     1300.287   NaN    NaN         NaN
7  2006-01-08     1207.985   NaN    NaN         NaN
8  2006-01-09     1529.323   NaN    NaN         NaN
9  2006-01-10     1576.911   NaN    NaN         NaN

In [4]:
opsd_daily.shape

(4383, 5)

In [6]:
opsd_daily.tail()

            Date  Consumption     Wind   Solar  Wind+Solar
4378  2017-12-27   1263.94091  394.507  16.530     411.037
4379  2017-12-28   1299.86398  506.424  14.162     520.586
4380  2017-12-29   1295.08753  584.277  29.854     614.131
4381  2017-12-30   1215.44897  721.247   7.467     728.714
4382  2017-12-31   1107.11488  721.176  19.980     741.156

In [7]:
opsd_daily = opsd_daily.set_index('Date')

In [8]:
opsd_daily.head(3)

            Consumption  Wind  Solar  Wind+Solar
Date
2006-01-01     1069.184   NaN    NaN         NaN
2006-01-02     1380.521   NaN    NaN         NaN
2006-01-03     1442.533   NaN    NaN         NaN